
package cn.cfg.java;

/**
* 这是文档注释
* @author 作者
* @version 创建时间：2021年11月4日 下午10:30:43
*/
public class BitOperatorr {
	public static void main(String[] args) {
		System.out.println(2&3);
		//2的原码 00000000 00000000 00000000 00000010
		//2的补码 00000000 00000000 00000000 00000010
		//三码合一
		//3的原码 00000000 00000000 00000000 00000011
		//3的补码 00000000 00000000 00000000 00000011
		
		
		//   2的补码&3的补码    00000000 00000000 00000000 00000010
		//	2的补码&3的补码 求出原码    00000000 00000000 00000000 00000010
		
		
		
		System.out.println(~-2);
		//-2的原码   10000000 00000000 00000000 00000010
		//-2的补码   11111111 11111111 11111111 11111110
		//-2取反补码  00000000 00000000 00000000 00000001
		//三码合一
		
		
		System.out.println(~2);
		// 原码 00000000 00000000 00000000 00000010
		// 补码 00000000 00000000 00000000 00000010
		//取反补码 11111111 11111111 11111111 11111101
		//取反补码求原码 10000000 00000000 00000000 00000011
		
		
		
		
		System.out.println(1>>2);
		//相当于1右移2位,
		//0001 向右移动两位成为0000
		//等价于1/2/2
		System.out.println(1<<2);
		//相当于1左移2位,
		//0001 向右移动两位成为0100 
		//等价于 1*2*2
		
		
		System.out.println(-10.5%3);
		
		System.out.println(-10.4%3);
		
		
		char ch = 50;
		System.out.println(ch);
		
		
		
		
		
	}
}
